using StudentTracking.Controllers.DTO.In;
using Tests;

namespace StudentTracking.Tests;

public class SpecialityDataSource : IRowSource
{
    private static int _now = 0;
    private static readonly string[][] _data = new[] {
        new []
        {"09.02.01",
        "Компьютерные системы и комплексы",
        "Техник по компьютерным системам",
        "3",
        "КСК",
        "т",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"
        },
        new []
        {"09.02.01",
        "Компьютерные системы и комплексы",
        "Специалист по компьютерным системам",
        "4",
        "КСК",
        "с",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
        new []
        {"09.02.02",
        "Компьютерные сети",
        "Техник по компьютерным сетям",
        "3",
        "КС",
        "т",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
         new []
        {"09.02.02",
        "Компьютерные сети",
        "Специалист по администрированию сети",
        "4",
        "КС",
        "а",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
        new []
        {"09.02.03",
        "Программирование в компьютерных системах",
        "Программист",
        "4",
        "ПКС",
        "",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
        new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Администратор баз данных",
        "4",
        "ИСП",
        "а",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
         new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Специалист по тестированию в области информационных технологий",
        "4",
        "ИСП",
        "т",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
          new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Программист",
        "4",
        "ИСП",
        "п",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
         new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Специалист по информационным системам",
        "4",
        "ИСП",
        "ис",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
         new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Специалист по информационным ресурсам",
        "4",
        "ИСП",
        "ир",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},
         new []
        {"09.02.07",
        "Информационные системы и программирование",
        "Разработчик веб и мультимедийных приложений",
        "4",
        "ИСП",
        "р",
        "Базовый",
        "Основное общее",
        "Среднее профессиональное",
        "специалисты"},

    };
    private static readonly string[] _headers =
    {
        SpecialityDTO.FgosCodeFieldName,
        SpecialityDTO.FgosNameFieldName,
        SpecialityDTO.QualificationFieldName,
        SpecialityDTO.CourseCountFieldName,
        SpecialityDTO.FgosPrefixFieldName,
        SpecialityDTO.QualificationPostfixFieldName,
        SpecialityDTO.TeachingDepthFieldName,
        SpecialityDTO.EducationalLevelInFieldName,
        SpecialityDTO.EducationalLevelOutFieldName,
        SpecialityDTO.ProgramTypeFieldName
    };


    public int ColumnCount => _headers.Length;
    public string GetData(int pos)
    {
        return _data[_now][pos];
    }

    public string? GetHeader(int pos)
    {
        return _headers[pos];
    }

    public void UpdateState()
    {
        _now++;
    }

    public int Length => _data.Length;
}